dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/SYSCTL_1.0.xml
    <register id="SYSCTL_SHDNIOREL" width="32" offset="0x131C" description="SHUTDOWN IO release control">
        <bitfield id="RELEASE" description="Set RELEASE to release the IO after a SHUTDOWN mode exit." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="TRUE" value="0x1" description="Release IO"/>
        </bitfield>
    </register>
    <register id="SYSCTL_EXRSTPIN" width="32" offset="0x1320" description="Disable the reset function of the NRST pin">
        <bitfield id="DISABLE" description="Set DISABLE to disable the reset function of the NRST pin.  Once set, this configuration is locked until the next POR." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="FALSE" value="0x0" description="Reset function of NRST pin is enabled"/>
            <bitenum id="TRUE" value="0x1" description="Reset function of NRST pin is disabled"/>
        </bitfield>
    </register>
    <register id="SYSCTL_SYSSTATUSCLR" width="32" offset="0x1324" description="Clear sticky bits of SYSSTATUS">
        <bitfield id="ALLECC" description="Set ALLECC to clear all ECC related SYSSTATUS indicators." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="CLEAR" value="0x1" description="Clear ECC error state"/>
        </bitfield>
    </register>
    <register id="SYSCTL_SWDCFG" width="32" offset="0x1328" description="Disable the SWD function on the SWD pins">
        <bitfield id="DISABLE" description="Set DISABLE to disable the SWD function on SWD pins, allowing the SWD pins to be used as GPIO." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="TRUE" value="0x1" description="Disable SWD function on SWD pins"/>
        </bitfield>
    </register>
    <register id="SYSCTL_FCCCMD" width="32" offset="0x132C" description="Frequency clock counter start capture">
        <bitfield id="GO" description="Set GO to start a capture with the frequency clock counter (FCC)." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="TRUE" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_SHUTDNSTORE0" width="32" offset="0x1400" description="Shutdown storage memory (byte 0)">
        <bitfield id="DATA" description="Shutdown storage byte 0" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_SHUTDNSTORE1" width="32" offset="0x1404" description="Shutdown storage memory (byte 1)">
        <bitfield id="DATA" description="Shutdown storage byte 1" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_SHUTDNSTORE2" width="32" offset="0x1408" description="Shutdown storage memory (byte 2)">
        <bitfield id="DATA" description="Shutdown storage byte 2" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_SHUTDNSTORE3" width="32" offset="0x140C" description="Shutdown storage memory (byte 3)">
        <bitfield id="DATA" description="Shutdown storage byte 3" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_ADC12B4MSPS1_PWREN" width="32" offset="0x2800" description="IP Enable Register">
        <bitfield id="ENABLE" description="IP Enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="Disable" value="0x0" description=""/>
            <bitenum id="Enable" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_ADC12B4MSPS1_RSTCTL" width="32" offset="0x2804" description="Power Control Register - Write Only Register, Always Read as 0">
        <bitfield id="RESETSTKYCLR" description="Clear the RESET STICKY Bit" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="Clear" value="0x1" description=""/>
        </bitfield>
        <bitfield id="RESETASSERT" description="Assert Reset to IP Domain." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="Do" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_ADC12B4MSPS1_CLKCFG" width="32" offset="0x2808" description="IP Clock Configuration Register">
        <bitfield id="CCONSTOP" description="Conversion Clock is ON during STOP Mode" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="Disable" value="0x0" description=""/>
            <bitenum id="Enable" value="0x1" description=""/>
        </bitfield>
        <bitfield id="CCONRUN" description="Conversion Clock is ON during RUN Mode" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="Disable" value="0x0" description=""/>
            <bitenum id="Enable" value="0x1" description=""/>
        </bitfield>
        <bitfield id="SAMPCLK" description="Sample Window Clock" begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="ULPCLK" value="0x0" description=""/>
            <bitenum id="SYSOSC" value="0x1" description=""/>
            <bitenum id="HFCLK" value="0x2" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_ADC12B4MSPS1_STAT" width="32" offset="0x2814" description="IP State Register - Read Only">
        <bitfield id="RESETSTKY" description="IP has been Reset" begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="clear" value="0x0" description=""/>
            <bitenum id="Set" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_FWEPROTMAIN" width="32" offset="0x3000" description="1 Sector Write-Erase per bit starting at address 0x0 of flash">
    </register>
    <register id="SYSCTL_FWPROTMAINDATA" width="32" offset="0x3014" description="Read-Write Protection for first 4 Sectors of Data Bank">
        <bitfield id="DATA" description="00: Both RW allowed 01: Read Only 10: No Read  No Write 11: No Read No Write - Not Used" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_FRXPROTMAINSTART" width="32" offset="0x3018" description="Flash RX Protection Start Address">
        <bitfield id="ADDR" description="Flash RX Protection Start Address 64B granularity" begin="21" end="6" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_FRXPROTMAINEND" width="32" offset="0x301C" description="Flash RX Protection End Address">
        <bitfield id="ADDR" description="Flash RX Protection End Address 64B granularity" begin="21" end="6" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_FIPPROTMAINSTART" width="32" offset="0x3020" description="Flash IP Protection Start Address">
        <bitfield id="ADDR" description="Flash IP Protection Start Address 64B granularity" begin="21" end="6" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_FIPPROTMAINEND" width="32" offset="0x3024" description="Flash IP Protection End Address">
        <bitfield id="ADDR" description="Flash IP Protection End Address 64B granularity" begin="21" end="6" width="16" rwaccess="R/W">
        </bitfield>
    </register>
