dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/SYSCTL_1.0.xml
    <register id="SYSCTL_FLBANKSWPPOLICY" width="32" offset="0x3038" description="Flash Bank Swap Policy">
        <bitfield id="DISABLE" description="1: Disables Policy To Allow Flash Bank Swapping" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="TRUE" value="0x1" description="Disallow Bank Swap"/>
        </bitfield>
    </register>
    <register id="SYSCTL_FLBANKSWP" width="32" offset="0x303C" description="Flash MAIN bank address swap">
        <bitfield id="USEUPPER" description="1: Use Upper Bank as Logical 0" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Normal (default) memory map addressing scheme"/>
            <bitenum id="ENABLE" value="0x1" description="Flash upper region address space swapped with lower region"/>
        </bitfield>
    </register>
    <register id="SYSCTL_FWENABLE" width="32" offset="0x3044" description="Security Firewall Enable Register">
        <bitfield id="FLIPPROT" description="1: Flash Read IP ProtectionActive" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="ENABLE" value="0x1" description="Turn On Flash IP Protection"/>
        </bitfield>
        <bitfield id="SRAMBOUNDARYLOCK" description="1: Blocks Writes from Changing SRAMBOUNDARY MMR" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="ENABLE" value="0x1" description="SRAMBOUNDARY MMR Locked"/>
        </bitfield>
        <bitfield id="FLRXPROT" description="1: Flash Read Execute Protection Active" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="ENABLE" value="0x1" description="Turn On Flash Read-eXecute Protection"/>
        </bitfield>
    </register>
    <register id="SYSCTL_SECSTATUS" width="32" offset="0x3048" description="Security Configuration  status">
        <bitfield id="FLBANKSWPPOLICY" description="1: Upper and Lower Banks allowed to be swapped" begin="10" end="10" width="1" rwaccess="R">
            <bitenum id="DISABLED" value="0x0" description=""/>
            <bitenum id="ENABLED" value="0x1" description=""/>
        </bitfield>
        <bitfield id="FLIPPROT" description="1: Flash IP Protection Active" begin="6" end="6" width="1" rwaccess="R">
            <bitenum id="DISABLED" value="0x0" description=""/>
            <bitenum id="ENABLED" value="0x1" description=""/>
        </bitfield>
        <bitfield id="FLBANKSWP" description="1: Upper and Lower Banks have been swapped" begin="12" end="12" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="SRAMBOUNDARYLOCK" description="1: SRAM Boundary MMR Locked" begin="8" end="8" width="1" rwaccess="R">
            <bitenum id="DISABLED" value="0x0" description=""/>
            <bitenum id="ENABLED" value="0x1" description=""/>
        </bitfield>
        <bitfield id="FLRXPROT" description="1: Flash Read Execute Protection Active" begin="4" end="4" width="1" rwaccess="R">
            <bitenum id="DISABLED" value="0x0" description=""/>
            <bitenum id="ENABLED" value="0x1" description=""/>
        </bitfield>
        <bitfield id="INITDONE" description="1: CSC has been completed" begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="NO" value="0x0" description="INIT is not yet done"/>
            <bitenum id="YES" value="0x1" description="INIT is done"/>
        </bitfield>
        <bitfield id="CSCEXISTS" description="1: CSC Exists in the system" begin="2" end="2" width="1" rwaccess="R">
            <bitenum id="NO" value="0x0" description="System does not have a CSC"/>
            <bitenum id="YES" value="0x1" description="System does have a CSC"/>
        </bitfield>
    </register>
    <register id="SYSCTL_INITDONE" width="32" offset="0x3060" description="INITCODE PASS">
        <bitfield id="PASS" description="INITCODE writes 1 for PASS, left unwritten a timeout will occur if not blocked" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="TRUE" value="0x1" description="INITCODE PASS"/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_ANACOMP0_PWREN" width="32" offset="0x8800" description="IP Enable Register">
        <bitfield id="ENABLE" description="IP Enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="Disable" value="0x0" description=""/>
            <bitenum id="Enable" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_ANACOMP0_RSTCTL" width="32" offset="0x8804" description="Power Control Register - Write Only Register, Always Read as 0">
        <bitfield id="RESETSTKYCLR" description="Clear the RESET STICKY Bit" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="Clear" value="0x1" description=""/>
        </bitfield>
        <bitfield id="RESETASSERT" description="Assert Reset to IP Domain." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="Do" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_ANACOMP0_CLKCFG" width="32" offset="0x8808" description="IP Clock Configuration Register">
        <bitfield id="BLOCKASYNC" description="Async Clock Request is blocked from starting SYSOSC or forcing bus clock to 32MHz" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="Disable" value="0x0" description=""/>
            <bitenum id="Enable" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_ANACOMP0_STAT" width="32" offset="0x8814" description="IP State Register - Read Only">
        <bitfield id="RESETSTKY" description="IP has been Reset" begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="clear" value="0x0" description=""/>
            <bitenum id="Set" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_ANACOMP1_PWREN" width="32" offset="0xA800" description="IP Enable Register">
        <bitfield id="ENABLE" description="IP Enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="Disable" value="0x0" description=""/>
            <bitenum id="Enable" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_ANACOMP1_RSTCTL" width="32" offset="0xA804" description="Power Control Register - Write Only Register, Always Read as 0">
        <bitfield id="RESETSTKYCLR" description="Clear the RESET STICKY Bit" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="Clear" value="0x1" description=""/>
        </bitfield>
        <bitfield id="RESETASSERT" description="Assert Reset to IP Domain." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="Do" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_ANACOMP1_CLKCFG" width="32" offset="0xA808" description="IP Clock Configuration Register">
        <bitfield id="BLOCKASYNC" description="Async Clock Request is blocked from starting SYSOSC or forcing bus clock to 32MHz" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="Disable" value="0x0" description=""/>
            <bitenum id="Enable" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_ANACOMP1_STAT" width="32" offset="0xA814" description="IP State Register - Read Only">
        <bitfield id="RESETSTKY" description="IP has been Reset" begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="clear" value="0x0" description=""/>
            <bitenum id="Set" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_ANACOMP2_PWREN" width="32" offset="0xC800" description="IP Enable Register">
        <bitfield id="ENABLE" description="IP Enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="Disable" value="0x0" description=""/>
            <bitenum id="Enable" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_ANACOMP2_RSTCTL" width="32" offset="0xC804" description="Power Control Register - Write Only Register, Always Read as 0">
        <bitfield id="RESETSTKYCLR" description="Clear the RESET STICKY Bit" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="Clear" value="0x1" description=""/>
        </bitfield>
        <bitfield id="RESETASSERT" description="Assert Reset to IP Domain." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="Do" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_ANACOMP2_CLKCFG" width="32" offset="0xC808" description="IP Clock Configuration Register">
        <bitfield id="BLOCKASYNC" description="Async Clock Request is blocked from starting SYSOSC or forcing bus clock to 32MHz" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="Disable" value="0x0" description=""/>
            <bitenum id="Enable" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_ANACOMP2_STAT" width="32" offset="0xC814" description="IP State Register - Read Only">
        <bitfield id="RESETSTKY" description="IP has been Reset" begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="clear" value="0x0" description=""/>
            <bitenum id="Set" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_DAC12B0_PWREN" width="32" offset="0x18800" description="IP Enable Register">
        <bitfield id="ENABLE" description="IP Enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="Disable" value="0x0" description=""/>
            <bitenum id="Enable" value="0x1" description=""/>
        </bitfield>
    </register>
